### In class Assigment 2 ###

In [18]:
import pandas as pd

df = pd.read_csv('/Users/julioberrocal/Desktop/Classes/Winter 2024/Advanced Programming/OIM7502_SP24/data/Wage.csv')

In [40]:
df.head(10) #printing first 10 rows
df.tail(10) #printing the last 10 rows

,year,age,maritl,race,education,region,jobclass,health,health_ins,logwage,wage
2990,2009,50,2. Married,2. Black,2. HS Grad,2. Middle Atlantic,1. Industrial,2. >=Very Good,2. No,4.886491,132.487821
2991,2003,26,1. Never Married,2. Black,3. Some College,2. Middle Atlantic,1. Industrial,2. >=Very Good,2. No,4.778151,118.884359
2992,2007,35,2. Married,1. White,1. < HS Grad,2. Middle Atlantic,1. Industrial,1. <=Good,2. No,4.698970,109.833986
2993,2006,31,2. Married,1. White,2. HS Grad,2. Middle Atlantic,2. Information,2. >=Very Good,1. Yes,4.633468,102.870247
2994,2009,31,2. Married,1. White,4. College Grad,2. Middle Atlantic,2. Information,2. >=Very Good,1. Yes,4.893207,133.380608
2995,2008,44,2. Married,1. White,3. Some College,2. Middle Atlantic,1. Industrial,2. >=Very Good,1. Yes,5.041393,154.685293
2996,2007,30,2. Married,1. White,2. HS Grad,2. Middle Atlantic,1. Industrial,2. >=Very Good,2. No,4.602060,99.689464
2997,2005,27,2. Married,2. Black,1. < HS Grad,2. Middle Atlantic,1. Industrial,1. <=Good,2. No,4.193125,66.229408
2998,2005,27,1. Never Married,1. White,3. Some College,2. Middle Atlantic,1. Industrial,2. >=Very Good,1. Yes,4.477121,87.981033
2999,2009,55,5. Separated,1. White,2. HS Grad,2. Middle Atlantic,1. Industrial,1. <=Good,1. Yes,4.505150,90.481913

In [48]:
total_rows = df.shape[0] #total rows
print(f'The number of rows in the data frame is {total_rows}')

The number of rows in the data frame is 3000

In [26]:
df.info() #metadata
df.describe() #more detailed info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        3000 non-null   int64
 1   age         3000 non-null   int64
 2   maritl      3000 non-null   object
 3   race        3000 non-null   object
 4   education   3000 non-null   object
 5   region      3000 non-null   object
 6   jobclass    3000 non-null   object
 7   health      3000 non-null   object
 8   health_ins  3000 non-null   object
 9   logwage     3000 non-null   float64
 10  wage        3000 non-null   float64
dtypes: float64(2), int64(2), object(7)
memory usage: 257.9+ KB

              year          age      logwage         wage
count  3000.000000  3000.000000  3000.000000  3000.000000
mean   2005.791000    42.414667     4.653905   111.703608
std       2.026167    11.542406     0.351753    41.728595
min    2003.000000    18.000000     3.000000    20.085537
25%    2004.000000    33.750000     4.447158    85.383940
50%    2006.000000    42.000000     4.653213   104.921507
75%    2008.000000    51.000000     4.857332   128.680488
max    2009.000000    80.000000     5.763128   318.342430

In [49]:
dtype_age = df['age'].dtype 
dtype_race = df['race'].dtype


print(f'The data type of the age column is: {dtype_age}')
print(f'The data type of the race column is: {dtype_race}')

The data type of the age column is: int64
The data type of the race column is: object

In [47]:
column_names = df.columns.to_list()

print(f'The column names are: {column_names}')

The column names are: ['year', 'age', 'maritl', 'race', 'education', 'region', 'jobclass', 'health', 'health_ins', 'logwage', 'wage']

In [45]:
index = df.index #displaying the index

print(f"The data frame's index is: {index}")

The data frame's index is: RangeIndex(start=0, stop=3000, step=1)

In [44]:
size = df.size #finding the size

print(f'The number of elements in the array is: {size}')

The number of elements in the array is: 33000

In [43]:
shape = df.shape

print(f'The number of rows is: {shape[0]}')
print(f'The number of columns is: {shape[1]}')

The number of rows is: 3000
The number of columns is: 11

In [53]:
wage_stats = df['wage'].describe()
age_stats = df['age'].describe()

print(f'The descriptive stats for wage are: \n{wage_stats}')

print(f'The descriptive stats for age are: \n{age_stats}')

The descriptive stats for wage are:
count    3000.000000
mean      111.703608
std        41.728595
min        20.085537
25%        85.383940
50%       104.921507
75%       128.680488
max       318.342430
Name: wage, dtype: float64
The descriptive stats for age are:
count    3000.000000
mean       42.414667
std        11.542406
min        18.000000
25%        33.750000
50%        42.000000
75%        51.000000
max        80.000000
Name: age, dtype: float64

In [56]:
stats_by_race = df.groupby('race')[['wage', 'age']].describe()

print(f'The stats for age and wage grouped by race are: \n {stats_by_race}')

The stats for age and wage grouped by race are:
             wage                                                           \
           count        mean        std        min        25%         50%
race
1. White  2480.0  112.563666  41.733830  20.085537  86.695155  106.348256
2. Black   293.0  101.601177  37.162486  23.274704  81.283253   94.072715
3. Asian   190.0  120.288288  46.422514  34.607418  87.981033  115.375039
4. Other    37.0   89.973326  29.153530  38.223583  71.319639   81.283253

                                     age                                     \
                 75%         max   count       mean        std   min    25%
race
1. White  130.042934  314.329336  2480.0  42.394758  11.365655  18.0  34.00
2. Black  117.146817  318.342430   293.0  43.563140  13.012913  18.0  33.00
3. Asian  144.828129  299.262977   190.0  41.821053  11.218823  22.0  32.25
4. Other  104.921507  169.528538    37.0  37.702703  11.553895  21.0  28.00


           50%   75%   max
race
1. White  42.0  51.0  80.0
2. Black  44.0  52.0  75.0
3. Asian  40.0  50.0  76.0
4. Other  39.0  47.0  65.0

In [57]:
wage_mean = df['wage'].mean()
print(wage_mean)

wage_median = df['wage'].median()
print(wage_median)

111.70360820174345
104.921506533664